<?php

    //1.打印出四分之一个菱形
    $a=5;
    for($i=1;$i<=$a;$i++){//第一层 控制行数
        for($j=1;$j<=$i;$j++){
            echo("*");
        }
        echo "<br/>";
    }

    /*
    运行结果
    *
    **
    ***
    ****
    *****

    */
    echo "<hr/>";


    //2.打印半个
    $line = 5;
    for($k=1;$k<=$line;$k++){//第一层 控制行数
        for($m=$line;$m>=$k;$m--){
            echo("&nbsp;");
        }
        for($n=2;$n<=$k;$n++){
            echo("**");
        }
        echo "*<br/>";
    }
    /*
    运行结果
         *
        ***
       *****
      *******
     *********

    */echo "<hr/>";

    //3.打印整个
    $b=5;
    for($k=1;$k<=$line;$k++){//第一层 控制行数
        for($m=$line;$m>=$k;$m--){
            echo("&nbsp;");
        }
        for($n=2;$n<=$k;$n++){
            echo("**");
        }
        echo "*<br/>";
    }

    for($l=2;$l<=$a;$l++){
        for($m=1;$m<=$l;$m++){
            echo("&nbsp;");
        }
        for($n=$a;$n>$l;$n--){
            echo("**");
        }
        echo "*<br />";
    }

    /*
    运行结果
         *
        ***
       *****
      *******
     *********
      *******
       *****
        ***
         *

    */

    //4.最后打印出空心的 
?>